$(document).ready(function () {
    $('#view1').click(function () {

       $('#Infos').html(` 
       <div class="container">
       <h1>桃園之旅</h1>
       <!-- 第一個景點 -->
       <hr>
       <div class="row">
         <div class="col-md-7">
           <h2>小烏來天空步道<small>（位於復興區）</small></h2>
           <p class="lead">凌空漫步70公尺高透明廊道，嘩啦啦溪水、超廣角視野，叫人腳趾都發麻！完成挑戰後，還有50公噸風動石定格秀，讓旅程驚嘆再一波。</p>
           <p>小烏來天空步道位於桃園市復興區，懸掛於小烏來瀑布上方，為了實現旅客漫步在雲端的夢想，桃園市政府耗資新台幣800萬元打造此座天空步道，後來更被民眾票選為全台最浪漫景點。
         天空步道外觀採簡約設計，以幾何線條配置，底部為強化玻璃的建築結構，凌空伸出11公尺的廊道，遊客只要站上距離瀑布底70公尺高的玻璃平台上，就能居高臨下欣賞小烏來溪谷的秀麗美景，以及氣勢磅礡的瀑布景觀，挑戰360度的全新視野。</p>
         </div>
         <div class="col-md-5">
           <img src="./img/桃園烏來.jfif" class="img-fluid">
         </div>
       </div>
       
       <!-- 第二個景點 -->
       <hr>
       <div class="row">
         <div class="col-md-7 order-md-5">
           <h2>大溪老街<small>(位於大西區)</small></h2>
           <p class="lead">玩味巴洛克建築語彙、來老商行體驗傳統木藝、古廟參拜關聖帝君、品味老字號豆干…，要認識大溪老城區文化，就從百年街屋開始。</p>
           <p>大溪是桃園最早發展的地方，透過大漢溪小帆船行駛淡水河，與大陸貿易興盛，造就了許多商號與商賈。日治大正時代流行巴洛克建築風格，和平路、中山路等老街，各商號融合巴洛克式繁飾主義和閩南傳統裝飾圖案，包括希臘山頭、羅馬柱子和中式的魚、蝙蝠等祈求吉慶的圖案混合，形成一種大溪專有的特色。和平老街因為開發較晚，老屋的保存狀況也較好，街上特色商店林立，十分熱鬧。</p>
         </div>
         <div class="col-md-5 order-md-1">
           <img src="./img/大溪老街.jpg" class="img-fluid">
         </div>
       </div>
       
       <!-- 第三個景點 -->
       <hr>
       <div class="row">
         <div class="col-md-7">
           <h2>竹圍漁港<small>（位於大園區）</small></h2>
           <p class="lead">幾乎沒有人能抵擋新鮮海鮮的美味逆襲，跟港口賞夕陽、看飛機同樣需列入行程清單的逛漁市，讓荷包君不必哭泣就能滿足吃貨的胃。</p>
           <p>竹圍漁港是北桃園具休閒功能的觀光漁港，美麗的景色也吸引偶像劇「偷心大聖PS男」來此取景。竹圍漁港的北邊入口，建有一座彩虹橋，採用紐爾遜鋼拱橋建造，是竹圍漁港的一大地標，入夜後更顯浪漫。</p>
         </div>
         <div class="col-md-5">
           <img src="./img/竹圍漁港.jfif" class="img-fluid">
         </div>
       </div>
       </div>`)
    
    
    
    })
    $('#view2').click(function () {

        $('#Infos').html(`
        <div class="container"> 
        <h1>台中之旅</h1>
        <!-- 第一個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7">
            <h2>臺中國家歌劇院<small>（位於西屯區）</small></h2>
            <p class="lead">「臺中國家歌劇院」由世界級建築師伊東豊雄設計，業界稱為「全球最難蓋的房子」。</p>
            <p>歌劇院以「美聲涵洞」（Sound Cave）為概念，利用現代的技術和建材，解放堅硬冷漠的環境；將線條直硬的城市輪廓，化為充滿生命力量的柔軟場域。</p>
    
            <p>環繞場館的流水及空中花園的意象，打破了舞台與觀眾、室內與室外的二元區分，創造更多人與建築和藝術對話的可能，回歸到生活的根本─「人」的感受。</p>
          </div>
          <div class="col-md-5">
            <img src="./img/台中歌劇院.jpg" class="img-fluid">
          </div>
        </div>
    
        <!-- 第二個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7 order-md-5">
            <h2>草悟道<small>(位於西區)</small></h2>
            <p class="lead">「草悟道(Calligraphy Greenway)」北起國立自然科學博物館，南至國立美術館前的綠園道。沿線包含國立自然科學博物館、市民廣場、勤美誠品綠園道、藝文空間、國立臺灣美術館、美食街等活動據點。</p>
            <p>
              草悟道，北起國立自然科學博物館、南至美術園道綠園道帶狀的都市空間架構，以及沿線的國立自然科學博物館、市民廣場、勤美誠品綠園道、藝文空間、國立臺灣美術館、美食街等活動結點，時而緊湊、時而靜謐的活動強度、氛圍與空間尺度，有濃有淡、有密有疏，如同書法裡「 行草 」般自然流暢的氣韻。
            </p>
          </div>
          <div class="col-md-5 order-md-1">
            <img src="./img/草悟道.jfif" class="img-fluid">
          </div>
        </div>
    
        <!-- 第三個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7">
            <h2>逢甲夜市<small>（位於西屯區）</small></h2>
            <p class="lead">逢甲夜市位於逢甲大學側門，從文華路一直延伸到福星路，是臺中夜市的龍頭。</p>
            <p>逢甲文華夜市位於逢甲大學側門，從文華路一直延伸到福星路，消費族群以二、三十歲的年輕人為主。因其有著位於學區和接近市區的地緣關係，逐漸成為臺中市夜市集團的龍頭。逢甲文華夜市與其它臺中市夜市最大不同之處，在於其不單是以飲食著稱，也包含了各式各樣的商店，營業時間亦較長。近年來，市政府重新規劃商圈風貌，整修路面，街道造景，並規劃停車空間，努力解決停車的問題。現今逢甲文華夜市嶄新面貌更吸引了不少消費族群，商圈更有逐漸擴大的現象，並成為民眾心目中票選「臺中市十大觀光景點」之一。</p>
          </div>
          <div class="col-md-5">
            <img src="./img/逢甲夜市.jpg" class="img-fluid">
          </div>
        </div>
        </div>
        `)
     
     })
     $('#view3').click(function () {

        $('#Infos').html(` 
        <div class="container">
        <h1>日本之旅</h1>
        <!-- 第一個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7">
            <h2>東京晴空塔 <small>（位於東京都墨田區）</small></h2>
            <p class="lead">由東武鐵道及其子公司東武塔晴空塔共同籌建，於2008年7月14日動工，2012年2月29日完工、同年5月22日正式啟用。其高度為634公尺，於2011年11月17日獲得金氏世界紀錄認證為「世界第一高塔」，成為全世界最高的塔式建</p>
            <p>從市區各處都能望見的「東京晴空塔」儼然已取代「東京鐵塔」成為日本首要都市的新象徵物。登上塔頂，底下的街道和對面風景均可盡收眼簾。天氣好的話，甚至能清楚看見遠處的富士山。除了「東京晴空塔」這座鐵塔之外，周邊還坐擁諸多景點，例如現代化複合商業設施「東京晴空街道」、復古商店街「下町人情KIRAKIRA橘商店街」，以及許多有趣的互動式博物館。</p>
          </div>
          <div class="col-md-5">
            <img src="./img/東京晴空塔.jpeg" class="img-fluid">
          </div>
        </div>
    
        <!-- 第二個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7 order-md-5">
            <h2>清水寺<small>(位於京都府京都市東山區)</small></h2>
            <p class="lead">清水寺是一座位於日本京都府京都市東山區清水的寺院，於778年（寶龜9年）前後由延鎮上人起造。清水寺的山號為音羽山，主要供奉千手觀音，原本屬於法相宗這一宗派但目前已獨立，成為北法相宗的大本山。</p>
            <p>
              清水寺與北山鹿苑寺（金閣寺）、嵐山天龍寺等同為京都境內最著名的名勝古蹟，一年四季前來朝拜的香客或來訪的觀光客是絡驛不絕。除此之外，清水寺也與石山寺（滋賀縣大津市），長谷寺（奈良縣櫻井市）等寺廟並列，自古以來就一直以嗣奉觀音的廟宇而為人所熟知，也是西國三十三箇所（在關西地區參拜33所觀音廟的巡訪活動）中第16所寺廟。自平安時代以來，就經常出現於日本文學作品當中。1994年，清水寺以身為古都京都的文化財之一部分，列名至世界文化遺產中。
            </p>
          </div>
          <div class="col-md-5 order-md-1">
            <img src="./img/清水寺.jpg.crdownload" class="img-fluid">
          </div>
        </div>
    
        <!-- 第三個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7">
            <h2>狸小路商店街<small>（位於北海道札幌市）</small></h2>
            <p class="lead">狸小路商店街，是日本北海道札幌市中央區的一條著名商店街。狸小路一帶是相當繁榮的商店集中地，通常簡稱「狸小路」。</p>
            <p>約200家商店鱗次櫛比。一個全天候的拱廊自西1丁目到西7丁目，下雨下雪或烈日照射，都絲毫不影響人們的購物。此商店街發祥於開拓使時代。1869年，明治政府在札幌設置了「北海道開拓使」，當時，在現在的狸小路2・3丁目周邊開始出現了商家與飲食店。1873年左右，這一帶開始被稱為「狸小路」。在拱廊內，新舊店鋪聚集，還有土特產商店和卡拉OK歌廳等，吸引了很多觀光客。充滿活力的商店街，讓人一步一個新發現。</p>
          </div>
          <div class="col-md-5">
            <img src="./img/狸小路.jpg" class="img-fluid">
          </div>
        </div>
      </div>
      </div>
      `)
    
     
     })
     $('#view4').click(function () {

        $('#Infos').html(` 
        <div class="container">
        <h1>美國之旅</h1>
        <!-- 第一個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7">
            <h2>自由女神像 <small>（位於紐約港自由島）</small></h2>
            <p class="lead">法國人民送給美國人民的禮物。塑像人物是身穿長袍的女子，代表羅馬神話中的自主神，她右手高舉火炬，左手的冊子上用羅馬數字寫有美國獨立宣言簽署日期：「JULY IV MDCCLXXVI」（1776年7月4日），腳下還有斷裂的鎖鏈。這座塑像是自由和美國的象徵，也是對外來移民的歡迎信號。</p>
            <p>自由女神穿著古希臘風格的服裝，頭戴光芒四射的冠冕，七道尖芒象徵世界七大洲。她造型宏偉，令人矚目。塑像拔地而起，高約46米，底座約27米，腰圍10米，她那未露笑容的嘴有1米寬。右手高舉象徵自由的火炬，長達12.8米，火炬的邊沿上可以站12個人。女神體態似一位古希臘美女，使人感到親切自然。當夜幕降臨，神像基座的燈光向上照射，將女神照得宛如一座淡青色的玉雕。</p>
          </div>
          <div class="col-md-5">
            <img src="./img/自由女神.jpg" class="img-fluid">
          </div>
        </div>
    
        <!-- 第二個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7 order-md-5">
            <h2>尼加拉大瀑布<small>(位於五大湖區尼加拉河)</small></h2>
            <p class="lead">尼加拉大瀑布（英語：Niagara Falls，源自印第安語，意為「雷神之水」。加拿大的華人也稱之為「拉格科瀑布」，亦經常被誤稱為尼加拉瓜大瀑布。）是由三座位於北美洲五大湖區尼加拉河上瀑布的總稱，平均流量為2,407立方公尺/秒，與伊瓜蘇瀑布、維多利亞瀑布並稱為世界三大跨國瀑布。尼加拉大瀑布以美麗的景色，巨大的水力發電能力和極具挑戰性的環境保護工程而聞名於世，是非常受遊客歡迎的旅遊景點。</p>
            <p>
              整個瀑布跨越加拿大的安大略省和美國的紐約州構成南部的尼加拉峽谷。三座瀑布按規模從大到小分別為馬蹄瀑布，美國瀑布，布里達爾維爾瀑布。其中，馬蹄瀑布位於美國和加拿大的邊境，美國瀑布全部位於美國境內並由山羊島分隔開。小些的布里達爾維爾瀑布也在美國境內，由月神島從美國瀑布隔開。
            </p>
          </div>
          <div class="col-md-5 order-md-1">
            <img src="./img/尼加拉.jpg" class="img-fluid">
          </div>
        </div>
    
        <!-- 第三個景點 -->
        <hr>
        <div class="row">
          <div class="col-md-7">
            <h2>大峽谷國家公園<small>（位於西南部的國家公園）</small></h2>
            <p class="lead">是美國西南部的國家公園，在1979年被列為世界自然遺產，以深達1500公尺，由科羅拉多河耗費萬年所切割出來的科羅拉多大峽谷景觀聞名於世。位於美國亞利桑那州的西北角。整個大峽谷走向為東西向，總長有454公里，寬度從最窄的6公里到25公里。將大峽谷分為南緣跟北緣。整個國家公園總面積為1,217,403畝。在地形上是高原地形，該地的高原稱為凱巴布高原（Kaibab）。</p>
            <p>大峽谷國家公園是1908年美國總統羅斯福所提倡與規劃的，初時只叫做國家紀念公園，在1911年劃立了國家保護區。
              1919年的2月26日，經過美國國會的法案通過，正式將大峽谷最深、景色最壯麗的一段，約有170公里長度的區域，成立了大峽谷國家公園，並建立起步道系統、生態與地質學的教育研究系統。
              目前大峽谷國家公園是全美最受歡迎的國家公園之一，據統計，每年的參觀人次有400多萬。</p>
          </div>
          <div class="col-md-5">
            <img src="./img/大峽谷.jpg" class="img-fluid">
          </div>
        </div>
        </div>
        `)

     })
     $('#home').click(function () {

        $('#Infos').html(` 
        <video  width="100%" autoplay muted loop>
  <source src="https://travel.tycg.gov.tw/content/films/attractions-films/712/ba3960de0ab34161b38a93edfbf328b2.mp4"  type="video/mp4">
</video>`)      
     
     
     })

})